// На оценку 3
/*let x0 = +prompt("Введите x координату левой нижней точки начала квадрата", 5),
    y0 = +prompt("Введите y координату левой нижней точки начала квадрата", 5),
    a = +prompt("Введите длинну стороны", 5),
    x1 = +prompt("Введите x координату искомой точки", 5),
    y1 = +prompt("Введите y координату искомой точки", 6);

function getResult() {
    if ((x1 > x0) && (y1 > y0) && (x1 < x0 + a) && (y1 < y0 + a)) {
        alert("Входит!");
    } else if ((x1 = x0) && (y1 = y0) && (x1 = x0 + a) && (y1 = y0 + a)) {
        alert("На стороне!")
    } else {
        alert("Не входит!");
    }
}
getResult();*/

// На оценку 4

/*let x1 = +prompt("Введите координату x центра окружности", 5);
let y1 = +prompt("Введите координату y центра окружности", 5);
let r1 = +prompt("ВВедите радиус внешней окружности", 6);
let r2 = +prompt("Введите радиус внутренней окружности", 3);
let x2 = +prompt("Введите x координату точки", 5);
let y2 = +prompt("Введите y координату точки", 4);

function getResult() {
    if ((x2 < x1 + r1) && (y2 < y1 + r1)) {
        alert("В дырке");
    } else if ((x2 > x1 + r1) && (y2 > y1 + r2) &&
        (x2 < x1 + r1) && (y2 < y1 + r2)) {
        alert("На бублике");
    } else {
        alert("За бубликом");
    }
}
getResult();*/

// На оценку 5

let x = +prompt("Введите x координату точки", 5);
let y = +prompt("Введите y координату точки", 5);

function getResult() {
    if (x > 0 && y > 0) {
        alert("Первая четверть")
    } else if (x < 0 && y > 0) {
        alert("Вторая четверть")
    } else if (x < 0 && y < 0) {
        alert("Третья четверть")
    } else if (x > 0 && y < 0) {
        alert("Четвертая четверть")
    }
}
getResult();